Долома/src/Documents/ДобавлениеЖивотного/ДобавлениеЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДобавлениеЖивотного</name>
  <comment>Документ вносит данные о рождении о купленных или существующих коров</comment>
  <registerRecords>InformationRegister.ДатаПредполагамогоЗапуска</registerRecords>
  <registerRecords>InformationRegister.СостояниеЖивотных</registerRecords>
  <registerRecords>InformationRegister.РодителиЖивотных</registerRecords>
  <registerRecords>InformationRegister.Отелы</registerRecords>
  <registerRecords>InformationRegister.ДатаПредполагаемогоОтёла</registerRecords>
  <registerRecords>InformationRegister.ПроизводственныеГруппы</registerRecords>
  <registerRecords>InformationRegister.ИнформацияОРождении</registerRecords>
  <registerRecords>InformationRegister.Взвешивания</registerRecords>
  <registerRecords>InformationRegister.Осеменения</registerRecords>
  <registerRecords>InformationRegister.УЗИисследования</registerRecords>
  <registerRecords>InformationRegister.РазмещениеЖивотных</registerRecords>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Кличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бирка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БиркаХорриот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЖивотного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусРазмещения</name>
      <type>
        <types>CatalogRef.Корпуса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТеленка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолТеленка</name>
      <type>
        <types>EnumRef.ПолЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>Мать</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Отец</name>
      <type>
        <types>CatalogRef.БыкиПлеменные</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоРождения</name>
      <type>
        <types>CatalogRef.Фермы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДанныеЖивотных</name>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОсеменений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семя</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоОсеменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоУЗИ</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЖивотного</name>
      <type>
        <types>EnumRef.СтатусЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтелов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоОтела</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кличка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредполагаемоегоОтела</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереводаВоВторойСухостой</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Documents/ДобавлениеЖивотного/ManagerModule.bsl
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//КЛИЧКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Кличка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Кличка");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//БИРКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Бирка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Бирка");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//НОМЕР ЖИВОТНОГО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"НомерЖивотного");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Номер животного");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА РОЖДЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ДатаРождения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Дата рождения");
	СтруктураДанных.Вставить("Тип", 								Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ВЕС ТЕЛЕНКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ВесТеленка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Вес теленка");
	СтруктураДанных.Вставить("Тип", 								Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ПОЛ ТЕЛЕНКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ПолТеленка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Пол теленка");
	СтруктураДанных.Вставить("Тип", 								Тип("ПеречислениеСсылка.ПолЖивотного"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОРПУС РАЗМЕЩЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"КорпусРазмещения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Корпус размещения");
	СтруктураДанных.Вставить("Тип", 								Тип("СправочникСсылка.Корпуса"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	
	//МАТЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Мать");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Мать");
	СтруктураДанных.Вставить("Тип", 								Тип("СправочникСсылка.Животные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ОТЕЦ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Отец");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Отец");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.БыкиПлеменные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//МЕСТО РОЖДЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"МестоРождения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Место рождения");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Фермы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО ОСЕМЕНЕНИЙ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КоличествоОсеменений");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество Осеменений");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//СЕМЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Семя");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Семя");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Номенклатура"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО ОСЕМЕНЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоОсеменения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего осеменения");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО УЗИ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоУЗИ");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего УЗИ");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//СТАТУС ЖИВОТНОГО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"СтатусЖивотного");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Статус животного");
	СтруктураДанных.Вставить("Тип", 					Тип("ПеречислениеСсылка.СтатусЖивотного"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО ОТЕЛОВ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КоличествоОтелов");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество отелов");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО ОТЕЛА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоОтела");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего отела");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
